Repository: BrianGSamuel/Kaizen-Web-Application
Catalog: Resources/SharedResource.*.resx
Languages: si, ta

source: Basic Info
si: මූලික තොරතුරු
ta: அடிப்படை தகவல்

source: Employee Details
si: සේවක විස්තර
ta: ஊழியர் விவரங்கள்

source: Kaizen Images
si: කයිසෙන් රූප
ta: கைசென் படங்கள்

source: Benefits
si: ප්‍රතිලාභ
ta: நன்மைகள்

source: Date Submitted
si: ඉදිරිපත් කළ දිනය
ta: சமர்ப்பிக்கப்பட்ட தேதி

source: Date Implemented
si: අනුග්‍රහ කළ දිනය
ta: செயல்படுத்தப்பட்ட தேதி

source: Kaizen No
si: කයිසෙන් අංකය
ta: கைசென் எண்

source: Department Name
si: අංශයේ නම
ta: துறை பெயர்

source: Plant
si: වැව

# PlantAutoSet
source: Plant is automatically set based on your user profile
si: වැව ඔබගේ පරිශීලක පැතිකඩ මත පදනම්ව ස්වයංක්‍රීයව සකස් කර ඇත

source: Employee Name
si: සේවකයාගේ නම
ta: ஊழியர் பெயர்

source: Employee No
si: සේවක අංකය
ta: ஊழியர் எண்

source: Employee Photo
si: සේවකයාගේ ඡායාරූපය
ta: ஊழியர் புகைப்படம்

# SuggestionDescription
source: Kaizen Suggestion Description
si: කයිසෙන් යෝජනා විස්තරය
ta: கைசென் பரிந்துரை விளக்கம்

# BeforeKaizenImage
source: Before Kaizen Image (Upload QR/Image)
si: කයිසෙන්ට පෙර රූපය (QR/රූපය උඩුගත කරන්න)
ta: கைசெனுக்கு முன் படம் (QR/படம் பதிவேற்று)

# AfterKaizenImage
source: After Kaizen Image (Upload QR/Image)
si: කයිසෙන්ට පසු රූපය (QR/රූපය උඩුගත කරන්න)
ta: கைசெனுக்கு பிறகு படம் (QR/படம் பதிவேற்று)

source: Cost Saving Information
si: පිරිවැය ඉතිරි කිරීමේ තොරතුරු
ta: செலவு சேமிப்பு தகவல்

source: No Cost Saving
si: පිරිවැය ඉතිරි කිරීමක් නැත
ta: செலவு சேமிப்பு இல்லை

source: Has Cost Saving
si: පිරිවැය ඉතිරි කිරීමක් ඇත
ta: செலவு சேமிப்பு உள்ளது

# CostSaving
source: Cost Saving ($ per year)
si: පිරිවැය ඉතිරි කිරීම (වර්ෂයකට $)
ta: செலவு சேமிப்பு (ஆண்டுக்கு $)

# DollarRate
source: Current Dollar Rate
si: වර්තමාන ඩොලර් අනුපාතය
ta: தற்போதைய டாலர் விகிதம்

source: Other Benefits
si: වෙනත් ප්‍රතිලාභ
ta: மற்ற நன்மைகள்

source: Previous
si: පෙර
ta: முந்தைய

source: Next
si: ඊළඟ
ta: அடுத்த

source: Submit Suggestion
si: යෝජනාව ඉදිරිපත් කරන්න
ta: பரிந்துரையை சமர்ப்பிக்கவும்

# ImageFormatError
source: Invalid image format. Only PNG, JPG, JPEG, WebP files up to 5MB are allowed.
si: අවලංගු රූප ආකෘතිය. PNG, JPG, JPEG, WebP ගොනු පමණක් 5MB දක්වා අවසර ඇත.
ta: தவறான பட வடிவம். PNG, JPG, JPEG, WebP கோப்புகள் மட்டும் 5MB வரை அனுமதிக்கப்படுகின்றன.

# ImageSizeError
source: Image file is too large. Maximum size is 5MB.
si: රූප ගොනුව ඉතා විශාලය. උපරිම ප්‍රමාණය 5MB වේ.
ta: பட கோப்பு மிகவும் பெரியது. அதிகபட்ச அளவு 5MB ஆகும்.

# RequiredFieldError
source: This field is required.
si: මෙම ක්ෂේත්‍රය අවශ්‍ය වේ.
ta: இந்த புலம் தேவை.

# EmployeeNameRequired
source: Employee Name is required.
si: සේවකයාගේ නම අවශ්‍ය වේ.
ta: ஊழியர் பெயர் தேவை.

# EmployeeNoRequired
source: Employee Number is required.
si: සේවක අංකය අවශ්‍ය වේ.
ta: ஊழியர் எண் தேவை.

# SuggestionDescriptionRequired
source: Suggestion Description is required.
si: යෝජනා විස්තරය අවශ්‍ය වේ.
ta: பரிந்துரை விளக்கம் தேவை.

# CostSavingRequired
source: Cost Saving amount is required when "Has Cost Saving" is selected.
si: "පිරිවැය ඉතිරි කිරීමක් ඇත" තෝරාගත් විට පිරිවැය ඉතිරි කිරීමේ මුදල අවශ්‍ය වේ.
ta: "செலவு சேமிப்பு உள்ளது" தேர்ந்தெடுக்கப்பட்டால் செலவு சேமிப்பு தொகை தேவை.

# DollarRateRequired
source: Dollar Rate is required when "Has Cost Saving" is selected.
si: "පිරිවැය ඉතිරි කිරීමක් ඇත" තෝරාගත් විට ඩොලර් අනුපාතය අවශ්‍ය වේ.
ta: "செலவு சேமிப்பு உள்ளது" தேர்ந்தெடுக்கப்பட்டால் டாலர் விகிதம் தேவை.

# PleaseCompleteStep
source: Please complete all required fields in this step.
si: මෙම පියවරේ අවශ්‍ය සියලු ක්ෂේත්‍ර සම්පූර්ණ කරන්න.
ta: இந்த படியில் தேவையான அனைத்து புலங்களையும் நிரப்பவும்.

# UploadImageHelp
source: Upload employee photo (PNG, JPG, JPEG, WebP up to 5MB)
si: සේවකයාගේ ඡායාරූපය උඩුගත කරන්න (PNG, JPG, JPEG, WebP 5MB දක්වා)
ta: ஊழியர் புகைப்படத்தை பதிவேற்றவும் (PNG, JPG, JPEG, WebP 5MB வரை)

# DepartmentAutoSet
source: Department Name is automatically set based on your registration
si: අංශයේ නම ඔබගේ ලියාපදිංචිය මත පදනම්ව ස්වයංක්‍රීයව සකස් කර ඇත
ta: துறை பெயர் உங்கள் பதிவின் அடிப்படையில் தானாக அமைக்கப்பட்டுள்ளது

# NoDepartmentFound
source: No department found for current user
si: වර්තමාන පරිශීලකයා සඳහා අංශයක් හමු නොවීය
ta: தற்போதைய பயனருக்கு துறை கிடைக்கவில்லை

# DepartmentLoaded
source: Department Name loaded
si: අංශයේ නම පූරණය කර ඇත
ta: துறை பெயர் ஏற்றப்பட்டது
